---
kind: type
id: T:Autodesk.Revit.DB.MEPConnectorInfo
source: html/8f5342e6-9d3d-12dc-b165-f0271d796208.htm
---
# Autodesk.Revit.DB.MEPConnectorInfo

MEP connector information.

## Syntax (C#)
```csharp
public class MEPConnectorInfo : IDisposable
```